app/controllers/api/v1/games_controller.rb

  def create
    game = Game.create(game_params)
---
INSERT INTO "games" ("duration", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["duration", 78], ["user_id", 1], ["created_at", "2020-01-24 18:50:47.584288"], ["updated_at", "2020-01-24 18:50:47.584288"]]

  def update
    game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]