app/controllers/api/v1/users_controller.rb

  def create
    # user = User.create(user_params)
    user = User.find_or_create_by(user_params)
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "dfd"], ["created_at", "2020-01-22 19:58:10.969436"], ["updated_at", "2020-01-22 19:58:10.969436"]]